// Составить программу вывода на экран "столбиком" четырех любых чисел.


using namespace std;

int main()
{
	cout << "52" << endl;
	cout << "42" << endl;
	cout << "65" << endl;
	cout << "13" << endl;

	return 0;
}
